Janechel/test1/PrimaryMemoryTable/C/STC89C52/Example/main.c
#include "reg52.h"
#include "servo.c"

#define READ_TEST 0                								//Read Servo Data Test
#define WRITE_TEST 0                							//Write Servo Data Test
#define SYNC_WRITE_TEST 0           					//Sync Write Test
#define PING_TEST 0                 								//PING Instruction Test
#define FACTORY_RESET_TEST 0        				//Factory Reset Test
#define PARAMETER_RESET_TEST 0      			//Parameter Reset Test
#define REBOOT_TEST 0               						//Reboot Test
#define CALIBRATION_TEST 0          					//Calibration Test
#define MODIFY_ID_TEST 0            						//Change Known Servo ID Test
#define MODIFY_UNKNOWN_ID_TEST 0    //Change Unknown Servo ID Test

uint16_t ms_count;

xdata uint8_t receive_data[20] = {0};				//Store the received status packet
xdata uint8_t receive_len = 0;         					//received Length
xdata uint8_t write_buffer[20] = { 0 }; 			//Write data to the memory table

void timer0_init()
{
    TMOD |= 0x01;
    TH0 = 0xFC;
    TL0 = 0x67;
    ET0 = 1;
    EA = 1;
    TR0 = 1;
}

void delay_ms(uint16_t ms)
{
    ms_count =  2 * ms; 
    while (ms_count);
}

void timer0_isr() interrupt 1 using 1
{
    TH0 = 0xFC;
    TL0 = 0x67;
    if (ms_count)
        ms_count--;
}

void uart_init()
{
	TMOD|=0X20;             //8-bit automatic reload timer
	SCON=0X40;	            //8-bit UART with variable baud rate
	PCON=0X80;              //Baud rate doubling
	TH1=0xff;	            //The baud rate is set to 115200
	TL1=0xff;
    ES=0;		            //Turn off receive interrupt
    EA=1;	                //CPU interrupts
    TR1=1;		            //Timer1 starts counting
}

void uart_init_recv()
{
    TMOD |= 0x20;            //8-bit automatic reload timer
    SCON = 0x50;             //8-bit UART with variable baud rate and serial reception enabled
    PCON = 0x80;             //Baud rate doubling
    TH1 = 0xff;              //The baud rate is set to 11520
    TL1 = 0xff;
    ES = 1;                  //Turn on receive interrupt
    EA = 1;                  //CPU interrupts
    TR1 = 1;                 //Timer1 starts counting
}

void uart_send(uint8_t order_data)
{
    SBUF = order_data;      
    while(!TI);    			
    TI = 0;      		
}


void uart_send_buffer(uint8_t *buffer, uint16_t length)
{
    uint16_t i;
    for (i = 0; i < length; i++) {
        uart_send(buffer[i]);
    }
}


void main()
{
	xdata uint8_t order_buffer[40];												                    //Store Generated Instructions
	xdata uint8_t order_buffer_len = 0;										                  //Instruction Length
	xdata uint16_t analysis_data = 0;											                    //Data parsed from the status packet

	struct servo_sync_parameter servo;
	
	timer0_init();

	while(1)
	{
#if FACTORY_RESET_TEST
    //Reset the servo to the factory default values.
		uart_init();
		servo_factory_reset(1, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		
		uart_init_recv();
		delay_ms(10);
		servo_factory_reset_analysis(receive_data);
		delay_ms(1000);
#endif			
		
#if PARAMETER_RESET_TEST
    //Reset the parameter settings of the servo.
		uart_init();
		servo_parameter_reset(1, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_parameter_reset_analysis(receive_data);
		delay_ms(1000);
#endif			

#if CALIBRATION_TEST
    //Calibrate the midpoint of the servo.
		uart_init();
		servo_calibration(1, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_calibration_analysis(receive_data);
		delay_ms(1000);
#endif				
		
#if REBOOT_TEST
    //Reboot the servo.
		uart_init();
		servo_reboot(1, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		delay_ms(1000);
#endif		

#if PING_TEST
    //Query the model number of servo ID1.
		uart_init();
		servo_ping(1, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_ping_analysis(receive_data, &analysis_data);
		delay_ms(1000);
#endif	

#if MODIFY_ID_TEST
    //Change the servo ID of servo ID1 to 2.
		uart_init();
		servo_modify_known_id(1, 2, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_read_present_current_analysis(receive_data, &analysis_data);
		delay_ms(1000);
#endif

#if MODIFY_UNKNOWN_ID_TEST
    //Change the servo ID of the servo with an unknown ID to 1.
		uart_init();
		servo_modify_unknown_id(2, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_read_present_current_analysis(receive_data, &analysis_data);
		delay_ms(1000);
#endif

#if READ_TEST
    //Read the present current of servo ID1.
		uart_init();
		servo_read_present_current(1, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_read_present_current_analysis(receive_data, &analysis_data);
		delay_ms(1000);

    //Read the present position of servo ID1.
		uart_init();
		servo_read_present_position(1, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_read_present_position_analysis(receive_data, &analysis_data);
		delay_ms(1000);
		
    //Read the present position and present current of servo ID1.
		uart_init();
    servo_read_present_position_and_present_current(1, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_read_present_position_and_present_current_analysis(receive_data, &analysis_data);
		delay_ms(1000);

    //Read the present velocity of servo ID1.
		uart_init();
		servo_read_present_velocity(1, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_read_present_velocity_analysis(receive_data, &analysis_data);
		delay_ms(1000);
		
    //Read the present profile position of servo ID1.
		uart_init();
		servo_read_present_profile_position(1, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

