Janechel/test1/PrimaryMemoryTable/C/STC89C52/Example/main.c
		uart_init_recv();
		delay_ms(10);
		servo_set_torque_switch_analysis(receive_data);	  
		delay_ms(1000);

    //Change the control mode of servo ID1 to the velocity base position control mode.
		uart_init();
		servo_set_control_mode(1, 1, order_buffer,&order_buffer_len);

		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_set_control_mode_analysis(receive_data);	
		delay_ms(1000);

    //Change the torque switch of servo ID1 to ON.
		uart_init();
		servo_set_torque_switch(1, 1, order_buffer,&order_buffer_len);

		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_set_torque_switch_analysis(receive_data);	  
		delay_ms(1000);

    //Change the velocity base target velocity of servo ID1 to 360¢X/s.
		uart_init();
		servo_set_velocity_base_target_velocity(1, 3600, order_buffer,&order_buffer_len);

		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);

		servo_set_velocity_base_target_velocity_analysis(receive_data);	
		delay_ms(1000);

    //Change the velocity base target ACC of servo ID1 to 500¢X/s2.
		uart_init();
		servo_set_velocity_base_target_acc(1, 150, order_buffer,&order_buffer_len);

		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);

		servo_set_velocity_base_target_acc_analysis(receive_data);	
		delay_ms(1000);

    //Change the velocity base target DEC of servo ID1 to 50¢X/s2.
		uart_init();
		servo_set_velocity_base_target_dec(1, 150, order_buffer,&order_buffer_len);

		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);

		servo_set_velocity_base_target_dec_analysis(receive_data);	
		delay_ms(1000);

    //Change the velocity base target position of servo ID1 to 150¢X.
		uart_init();
		servo_set_velocity_base_target_position(1, 0, order_buffer,&order_buffer_len);

		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_set_velocity_base_target_position_analysis(receive_data);	  
		delay_ms(1000);

    //Change the torque switch of servo ID1 to OFF.
		uart_init();
		servo_set_torque_switch(1, 0, order_buffer,&order_buffer_len);

		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_set_torque_switch_analysis(receive_data);		
		delay_ms(1000);

    //Change the control mode of servo ID1 to the time base position control mode.
		uart_init();
		servo_set_control_mode(1, 0, order_buffer,&order_buffer_len);

		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_set_control_mode_analysis(receive_data);	
		delay_ms(1000);

    //Change the torque switch of servo ID1 to ON.
		uart_init();
		servo_set_torque_switch(1, 1, order_buffer,&order_buffer_len);

		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);
		servo_set_torque_switch_analysis(receive_data);		 
		delay_ms(1000);

    //Change the time base target ACC of servo ID1 to 5.
		uart_init();
		servo_set_time_base_target_acc(1, 5, order_buffer,&order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);

		servo_set_time_base_target_acc_analysis(receive_data);	 
		delay_ms(1000);

    //Change the time base target position and moving time of servo ID1 to 300¢X, 500ms respectively.
		uart_init();
		servo_set_time_base_target_position_and_moving_time(1, 3000, 500, order_buffer,&order_buffer_len);

		uart_send_buffer(order_buffer, order_buffer_len);

		uart_init_recv();
		delay_ms(10);

		servo_set_time_base_target_position_and_moving_time_analysis(receive_data);		 
		delay_ms(1000);
#endif

#if SYNC_WRITE_TEST
		servo.id_counts = 2;         //Sync write two servos
		servo.id[0] = 1;                //Set the ID of the first servo to 1
		servo.id[1] = 2;                //Set the ID of the second servo to 2
		
		//Change the torque switch of the servo ID1, ID2 to OFF respectively.
		servo.torque_switch[0] = 0;
		servo.torque_switch[1] = 0;
		uart_init();
		servo_sync_write_torque_switch(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);

    //Change the control mode of the servo ID1, ID2 to velocity base position control mode respectively.
    servo.control_mode[0] = 1;
    servo.control_mode[1] = 1;
		uart_init();
    servo_sync_write_control_mode(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);
		
		//Change the velocity base target ACC of servo ID1, ID2 to 500¢X/s2 and 50¢X/s2, respectively.  
    //Set the acceleration of servo ID1 and ID2 to 10 and 1, respectively, corresponding to the previous ID settings.
    servo.acc_velocity[0] = 10;
    servo.acc_velocity[1] = 1;
		uart_init();
		servo_sync_write_velocity_base_target_acc(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);
		
		//Change the velocity base target DEC of servo ID1, ID2 to 50¢X/s2 and 500¢X/s2, respectively.
    //Set the deceleration of servo ID1 and ID2 to 1 and 10, respectively, corresponding to the previous ID settings.
    servo.dec_velocity[0] = 1;
    servo.dec_velocity[1] = 10;
		uart_init();
    servo_sync_write_velocity_base_target_dec(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);
		
	 //Change the velocity base target velocity of the servo ID1, ID2 to 360¢X/s2 and 720¢X/s2, respectively.
    //Set the velocity of servo ID1 and ID2 to 3600 and 7200, respectively, corresponding to the previous ID settings.
    servo.velocity[0] = 3600;
    servo.velocity[1] = 7200;
		uart_init();
    servo_sync_write_velocity_base_target_velocity(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);
		
		//Change the velocity base target velocity of the servo ID1, ID2 to 150¢X midpoint and 0¢X position, respectively.
    //Set the position of servo ID1 and ID2 to 1500 and 0, respectively, corresponding to the previous ID settings.
    servo.position[0] = 1500;
    servo.position[1] = 0;
		uart_init();
    servo_sync_write_velocity_base_target_position(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);
		
		//Change the velocity base target velocity of servo ID1 ,ID2 to 1800 and 3600, and the position to 3000 and 3000, respectively
    servo.velocity[0] = 1800;
    servo.velocity[1] = 3600;
    servo.position[0] = 3000;
    servo.position[1] = 3000;
		uart_init();
    servo_sync_write_velocity_base_target_position_and_velocity(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);
		
