Janechel/test1/PrimaryMemoryTable/C/STC89C52/Example/main.c
		//Set the velocity of servo ID1 and ID2 to 3600 and 3600, set their positions to 0 and 0, set their accelerations to 100 and 100, and their decelerations to 100 and 100, respectively.
    servo.velocity[0] = 3600;
    servo.velocity[1] = 3600;
    servo.position[0] = 0;
    servo.position[1] = 0;
    servo.acc_velocity[0] = 100;
    servo.acc_velocity[1] = 100;
    servo.dec_velocity[0] = 100;
    servo.dec_velocity[1] = 100;
		uart_init();
    servo_sync_write_velocity_base_target_acc_dec_velocity_and_position(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);
		
		//Change the torque switch of the servo ID1, ID2 to OFF respectively.
		servo.torque_switch[0] = 0;
		servo.torque_switch[1] = 0;
		uart_init();
		servo_sync_write_torque_switch(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);

		//Change the control mode of servo ID1, ID2 to time base position control mode respectively.
		servo.control_mode[0] = 0;
		servo.control_mode[1] = 0;
		uart_init();
		servo_sync_write_control_mode(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);

		//Change the time base target ACC of servo ID1 to 1 and 5 respectively
		servo.acc_velocity_grade[0] = 1;
		servo.acc_velocity_grade[1] = 5;
		uart_init();
		servo_sync_write_time_base_target_acc(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);

		//Change the time base target position and moving time of servo ID1 to 150¢X midpoint and 1s, 0¢X and 500ms respectively.
		servo.position[0] = 1500;
		servo.position[1] = 0;
		servo.time[0] = 1000;
		servo.time[1] = 500;
		uart_init();
		servo_sync_write_time_base_target_position_and_moving_time(servo, order_buffer, &order_buffer_len);
		uart_send_buffer(order_buffer, order_buffer_len);
		delay_ms(1000);
#endif
	}		
}

void uart() interrupt 4
{
	if(RI)                                       
	{
		RI = 0;                                
		receive_data[receive_len++] = SBUF;    
	}				
}

